# Michael Reese
## Wk 13/14 - 4/25/2021
### Python - Pandas DataFrame - Grouping and Mapping

In [2]:
import numpy as np

from pandas import Series, DataFrame
import pandas as pd

In [5]:
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
                'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [7]:
st_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [8]:
df['state'] = df['city'].map(st_map)

df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [9]:
#apply
def meter(x):
    return x / 3.3808

In [12]:
df['altitude'] = df['altitude'].apply(meter)

df

         city     altitude       state
0        Alma  3062.884524    Colorado
1  Brian Head  2898.722196        Utah
2    Fox Park  2680.430667     Wyoming
3   Lake Mary  2652.035021  California

In [14]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT','OH','TX','OR'])

df

           b         d         e
UT  0.001357 -0.739489  0.098090
OH -1.501569 -0.083692 -0.618942
TX  0.957362  0.427014 -1.373201
OR  1.498429  0.180845 -1.269398

In [15]:
def dif(x):
    return x.max() - x.min()

In [16]:
df.apply(dif)

b    2.999999
d    1.166502
e    1.471291
dtype: float64

In [17]:
df.apply(dif, axis=1)

UT    0.837579
OH    1.417878
TX    2.330563
OR    2.767827
dtype: float64

In [18]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.501569  1.0  0.0  0.0
-1.373201  0.0  0.0  1.0
-1.269398  0.0  0.0  1.0
-0.739489  0.0  1.0  0.0
-0.618942  0.0  0.0  1.0
-0.083692  0.0  1.0  0.0
 0.001357  1.0  0.0  0.0
 0.098090  0.0  0.0  1.0
 0.180845  0.0  1.0  0.0
 0.427014  0.0  1.0  0.0
 0.957362  1.0  0.0  0.0
 1.498429  1.0  0.0  0.0

In [21]:
#groupby
df = DataFrame({'k1': ['a','a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})

df

  k1   k2  dataset1  dataset2
0  a  one  0.818888  0.444052
1  a  two -1.119857  1.205518
2  b  one  0.079552 -0.466908
3  b  two -0.667498 -0.029417
4  c  one  1.265798 -1.086537

In [22]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [23]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [24]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [25]:
df['dataset1'].groupby(df['k1']).mean()

k1
a   -0.150484
b   -0.293973
c    1.265798
Name: dataset1, dtype: float64

In [28]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a  -0.150484  0.824785
b  -0.293973 -0.248163
c   1.265798 -1.086537

In [29]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.818888  0.444052
   two -1.119857  1.205518
b  one  0.079552 -0.466908
   two -0.667498 -0.029417
c  one  1.265798 -1.086537

In [32]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.mean